#### Terraform Plan 📋 `dev/monitoring`

**Summary:** 13:53:33.680 STDOUT terraform: Plan: 2 to add, 0 to change, 0 to destroy.

<details><summary>Show Plan Details</summary>

```terraform
13:53:33.677 STDOUT terraform:   + create
13:53:33.677 STDOUT terraform: Terraform will perform the following actions:
13:53:33.677 STDOUT terraform:   # helm_release.victoria_metrics_k8s_stack will be created
13:53:33.677 STDOUT terraform:   + resource "helm_release" "victoria_metrics_k8s_stack" {
13:53:33.677 STDOUT terraform:       + atomic                     = false
13:53:33.677 STDOUT terraform:       + chart                      = "victoria-metrics-k8s-stack"
13:53:33.677 STDOUT terraform:       + cleanup_on_fail            = false
13:53:33.677 STDOUT terraform:       + create_namespace           = false
13:53:33.677 STDOUT terraform:       + dependency_update          = false
13:53:33.677 STDOUT terraform:       + disable_crd_hooks          = false
13:53:33.677 STDOUT terraform:       + disable_openapi_validation = false
13:53:33.677 STDOUT terraform:       + disable_webhooks           = false
13:53:33.677 STDOUT terraform:       + force_update               = false
13:53:33.677 STDOUT terraform:       + id                         = (known after apply)
13:53:33.677 STDOUT terraform:       + lint                       = false
13:53:33.677 STDOUT terraform:       + max_history                = 0
13:53:33.677 STDOUT terraform:       + metadata                   = (known after apply)
13:53:33.677 STDOUT terraform:       + name                       = "vm-stack"
13:53:33.677 STDOUT terraform:       + namespace                  = "monitoring"
13:53:33.677 STDOUT terraform:       + pass_credentials           = false
13:53:33.678 STDOUT terraform:       + recreate_pods              = false
13:53:33.678 STDOUT terraform:       + render_subchart_notes      = true
13:53:33.678 STDOUT terraform:       + replace                    = false
13:53:33.678 STDOUT terraform:       + repository                 = "https://victoriametrics.github.io/helm-charts/"
13:53:33.678 STDOUT terraform:       + reset_values               = false
13:53:33.678 STDOUT terraform:       + reuse_values               = false
13:53:33.678 STDOUT terraform:       + set_wo                     = (write-only attribute)
13:53:33.678 STDOUT terraform:       + skip_crds                  = false
13:53:33.678 STDOUT terraform:       + status                     = "deployed"
13:53:33.678 STDOUT terraform:       + take_ownership             = false
13:53:33.678 STDOUT terraform:       + timeout                    = 900
13:53:33.678 STDOUT terraform:       + upgrade_install            = false
13:53:33.678 STDOUT terraform:       + values                     = [
13:53:33.678 STDOUT terraform:           + <<-EOT
13:53:33.678 STDOUT terraform:                 victoria-metrics-operator:
13:53:33.678 STDOUT terraform:                   enabled: true
13:53:33.678 STDOUT terraform:                 
13:53:33.678 STDOUT terraform:                 # Single-node configuration for cost efficiency
13:53:33.678 STDOUT terraform:                 vmsingle:
13:53:33.678 STDOUT terraform:                   enabled: true
13:53:33.678 STDOUT terraform:                   spec:
13:53:33.678 STDOUT terraform:                     retentionPeriod: 14d
13:53:33.678 STDOUT terraform:                     storage:
13:53:33.678 STDOUT terraform:                       accessModes:
13:53:33.678 STDOUT terraform:                         - ReadWriteOnce
13:53:33.678 STDOUT terraform:                       resources:
13:53:33.678 STDOUT terraform:                         requests:
13:53:33.678 STDOUT terraform:                           storage: "10Gi"
13:53:33.678 STDOUT terraform:                 
13:53:33.678 STDOUT terraform:                 # Disable cluster version by default
13:53:33.679 STDOUT terraform:                 vmcluster:
13:53:33.679 STDOUT terraform:                   enabled: false
13:53:33.679 STDOUT terraform:                 
13:53:33.679 STDOUT terraform:                 vmagent:
13:53:33.679 STDOUT terraform:                   enabled: true
13:53:33.679 STDOUT terraform:                 
13:53:33.679 STDOUT terraform:                 vmalert:
13:53:33.679 STDOUT terraform:                   enabled: true
13:53:33.679 STDOUT terraform:                 
13:53:33.679 STDOUT terraform:                 grafana:
13:53:33.679 STDOUT terraform:                   enabled: true
13:53:33.679 STDOUT terraform:                   ingress:
13:53:33.679 STDOUT terraform:                     enabled: false
13:53:33.679 STDOUT terraform:                   persistence:
13:53:33.679 STDOUT terraform:                     enabled: true
13:53:33.679 STDOUT terraform:                     size: "2Gi"
13:53:33.679 STDOUT terraform:                 
13:53:33.679 STDOUT terraform:                 # Setup easy access for initial testing
13:53:33.679 STDOUT terraform:                 serviceAccount:
13:53:33.679 STDOUT terraform:                   create: true
13:53:33.679 STDOUT terraform:             EOT,
13:53:33.679 STDOUT terraform:         ]
13:53:33.679 STDOUT terraform:       + verify                     = false
13:53:33.679 STDOUT terraform:       + version                    = "0.72.4"
13:53:33.679 STDOUT terraform:       + wait                       = true
13:53:33.679 STDOUT terraform:       + wait_for_jobs              = false
13:53:33.679 STDOUT terraform:     }
13:53:33.679 STDOUT terraform:   # kubernetes_namespace_v1.monitoring will be created
13:53:33.679 STDOUT terraform:   + resource "kubernetes_namespace_v1" "monitoring" {
13:53:33.679 STDOUT terraform:       + id                               = (known after apply)
13:53:33.679 STDOUT terraform:       + wait_for_default_service_account = false
13:53:33.679 STDOUT terraform:       + metadata {
13:53:33.679 STDOUT terraform:           + generation       = (known after apply)
13:53:33.680 STDOUT terraform:           + labels           = {
13:53:33.680 STDOUT terraform:               + "name" = "monitoring"
13:53:33.680 STDOUT terraform:             }
13:53:33.680 STDOUT terraform:           + name             = "monitoring"
13:53:33.680 STDOUT terraform:           + resource_version = (known after apply)
13:53:33.680 STDOUT terraform:           + uid              = (known after apply)
13:53:33.680 STDOUT terraform:         }
13:53:33.680 STDOUT terraform:     }
13:53:33.680 STDOUT terraform: Plan: 2 to add, 0 to change, 0 to destroy.
13:53:33.680 STDOUT terraform: Changes to Outputs:
13:53:33.680 STDOUT terraform:   + helm_release_name   = "vm-stack"
13:53:33.680 STDOUT terraform:   + helm_release_status = "deployed"
13:53:33.680 STDOUT terraform:   + namespace           = "monitoring"
13:53:33.745 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
13:53:33.745 STDOUT terraform: Saved the plan to: tfplan
13:53:33.745 STDOUT terraform: To perform exactly these actions, run the following command to apply:
13:53:33.745 STDOUT terraform:     terraform apply "tfplan"
```

</details>

*Pusher: @krukmaksym, Action: `pull_request`, Workflow: `Terraform PR Validation`*